import { getHistory, setHistory as apiSetHistory } from "../api/utils";

const text = `
████████╗███████╗██████╗ ███╗   ███╗██╗██████╗  ██████╗  ██████╗ ███╗   ███╗
╚══██╔══╝██╔════╝██╔══██╗████╗ ████║██║██╔══██╗██╔═══██╗██╔═══██╗████╗ ████║
   ██║   █████╗  ██████╔╝██╔████╔██║██║██████╔╝██║   ██║██║   ██║██╔████╔██║
   ██║   ██╔══╝  ██╔══██╗██║╚██╔╝██║██║██╔══██╗██║   ██║██║   ██║██║╚██╔╝██║
   ██║   ███████╗██║  ██║██║ ╚═╝ ██║██║██║  ██║╚██████╔╝╚██████╔╝██║ ╚═╝ ██║
   ╚═╝   ╚══════╝╚═╝  ╚═╝╚═╝     ╚═╝╚═╝╚═╝  ╚═╝ ╚═════╝  ╚═════╝ ╚═╝     ╚═╝
                                                                            
`;
const INITIAL_MESSAGE = {
  type: "output",
  text: `${text}\nWelcome to termiRoom!\nWrite 'help' to check the available commands\nVisit the Github repo for more information: https://github.com/kurogamidesuu/TermiRoom.git`,
};

let cache = null;

export const getServerHistory = async () => {
  if (cache) return cache;
  try {
    const history = await getHistory();

    cache = history.length > 0 ? history : [INITIAL_MESSAGE];
  } catch {
    cache = [INITIAL_MESSAGE];
  }
  return cache;
};

export const setServerHistory = async (newHistory) => {
  cache = newHistory;
  await apiSetHistory(newHistory);
};

export const clearHistoryCache = () => {
  cache = null;
};
